[
    {
      "image_link": "https://img.freepik.com/premium-photo/random-picture-indian-street-dog-hd_181020-4812.jpg",
      "animal_name": "Street Dog",
      "description": "Street dogs require a high-protein diet for energy. You can feed them boiled rice mixed with boiled chicken, dog biscuits, or leftover food. Avoid spicy, oily, or salty food, as it can upset their stomach."
    },
    {
      "image_link": "https://c4.wallpaperflare.com/wallpaper/312/105/108/street-black-cat-eyes-bombay-cat-wallpaper-preview.jpg",
      "animal_name": "Street Cat",
      "description": "Street cats thrive on protein-rich diets. You can feed them cooked fish, boiled chicken, or cat food. Avoid milk, as many cats are lactose intolerant, and stay clear of chocolates, onions, or garlic."
    },
    {
      "image_link": "https://w0.peakpx.com/wallpaper/353/254/HD-wallpaper-animal-cow-dairy-cow.jpg",
      "animal_name": "Cow",
      "description": "Cows found on the streets should be fed green grass, fresh vegetables, or leftover chapati. Avoid feeding them plastic or packaged food as it harms their digestive system."
    },
    {
      "image_link": "https://t3.ftcdn.net/jpg/03/63/64/18/360_F_363641865_OrwlIDpQzDc0sEOV6mjiFqvmEyYA7COL.jpg",
      "animal_name": "Buffalo",
      "description": "Buffaloes can be fed fresh grass, dry hay, and water-soaked grains. Supplement their diet with vegetables like carrots and cucumbers to maintain good health."
    },
    {
      "image_link": "https://t3.ftcdn.net/jpg/04/44/67/72/360_F_444677224_8GcsBVNM0HTHBBz1xIqm2GsEMHf5MbG0.jpg",
      "animal_name": "Monkey",
      "description": "Monkeys love fruits like bananas, apples, and mangoes. Avoid sugary snacks or processed food, as it can cause health issues. Nuts like peanuts or almonds can also be given in moderation."
    },
    {
      "image_link": "https://cdn.pixabay.com/photo/2017/09/08/03/50/homing-pigeon-2727563_640.jpg",
      "animal_name": "Pigeon",
      "description": "Pigeons can be fed grains like wheat, rice, or millet. You can also give them small pieces of bread soaked in water. Avoid feeding them salty or oily food."
    },
    {
      "image_link": "https://t3.ftcdn.net/jpg/02/30/94/56/360_F_230945678_w0MjvyEwhrqVqalxvtjRyFXwvHaSrbCe.jpg",
      "animal_name": "Crow",
      "description": "Crows are omnivores and can be fed cooked rice, small meat scraps, or soaked bread. They also enjoy small fruits like grapes or berries."
    },
    {
      "image_link": "https://t3.ftcdn.net/jpg/02/32/96/06/360_F_232960682_OLkHQctWVEKtc36CYw6gDhF96VKHxqbC.jpg",
      "animal_name": "Squirrel",
      "description": "Squirrels enjoy nuts, seeds, and small pieces of fruits like apples or bananas. Avoid feeding them processed food or anything containing artificial sweeteners."
    },
    {
      "image_link": "https://www.shutterstock.com/image-photo/brown-white-goat-standing-next-600nw-2446247795.jpg",
      "animal_name": "Goat",
      "description": "Goats can eat grass, tree leaves, or vegetable scraps. Fresh water is essential for their hydration. Avoid feeding them any plastic or toxic plants."
    },
    {
      "image_link": "https://c0.wallpaperflare.com/preview/696/592/883/pekin-duck-long-island-duck-portrait-bird.jpg",
      "animal_name": "Duck",
      "description": "Ducks can be fed grains like wheat or oats. They also enjoy vegetables like peas or corn. Avoid feeding them bread, as it has little nutritional value for them."
    },
    {
      "image_link": "https://w0.peakpx.com/wallpaper/11/976/HD-wallpaper-rooster-cock-hen-roosten-chicken.jpg",
      "animal_name": "Hen",
      "description": "Hens eat grains like wheat, rice, or corn. You can also give them vegetable scraps and fruits like watermelon or papaya. Ensure they have access to clean drinking water."
    },
    {
      "image_link": "https://c1.wallpaperflare.com/preview/698/409/232/bunnies-rabbits-bunny-cute.jpg",
      "animal_name": "Rabbit",
      "description": "Rabbits found on streets can be fed leafy greens like spinach, coriander, or lettuce. You can also give them carrots and small apple slices. Avoid feeding them anything sugary or starchy."
    },
    {
        "image_link": "https://w0.peakpx.com/wallpaper/460/339/HD-wallpaper-alligator-predator-crocodile-lake.jpg",
        "animal_name": "Crocodile",
        "description": "Crocodiles are carnivorous reptiles and primarily eat meat. If you come across a crocodile in need, consult wildlife authorities first. However, in emergencies, they can be fed raw fish, chicken, or small pieces of meat. Avoid feeding processed or cooked food, as it is not suitable for them. Always maintain a safe distance when dealing with crocodiles."
      }      
  ]
  